ypa-iteration0/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY first_name
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "1"]]
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "created_by", "deleted", "dob", "donate", "email", "first_name", "interests", "last_name", "organization", "password", "phone", "updated_at", "updated_by", "volunteer") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save